// 考虑这两个无限序列：
	
	// 1.0 + 1.0/2.0 + 1.0/3.0 + 1.0/4.0 + ...
	// 1.0 - 1.0/2.0 + 1.0/3.0 - 1.0/4.0 + ...

// 编写一个程序来计算这两个序列不断变化的总和，直到达到某个次数。让用户交互地输入这个次数。
// 看看在 20 次、 100 次和 500 次之后的总和。是否每个序列都看上去要收敛于某个值？
// 提示： 奇数个 -1 相乘的值为 -1 ，而偶数个 -1 相乘的值为 1 。

#include <stdio.h>

int main()
{
	int times;
	int i;
	float sum0, sum1;
	
	scanf("%d", &times);
	
	for (i = 1, sum0 = 0, sum1 = 0; i <= times; i++)
	{
		int temp = i % 2 ? -1 : 1;
		sum0 += 1.0/i;
		sum1 += 1.0 * temp /i;
		
		printf("%f\t", sum0);
		printf("%f\n", sum1);
	}
} 
